In [ ]:
%load tutorial.db [rw]

In [ ]:
Create table If Not Exists Teacher (teacher_id int, subject_id int, dept_id int)

In [ ]:
insert into Teacher (teacher_id, subject_id, dept_id) values ('1', '2', '3')

In [ ]:
insert into Teacher (teacher_id, subject_id, dept_id) values ('1', '2', '4')

In [ ]:
insert into Teacher (teacher_id, subject_id, dept_id) values ('1', '3', '3')

In [ ]:
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '1', '1')

In [ ]:
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '2', '1')

In [ ]:
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '3', '1')

In [ ]:
insert into Teacher (teacher_id, subject_id, dept_id) values ('2', '4', '1')

In [ ]:
select * from teacher

+------------+------------+---------+
| teacher_id | subject_id | dept_id |
+------------+------------+---------+
| 1          | 2          | 3       |
+------------+------------+---------+
| 1          | 2          | 4       |
+------------+------------+---------+
| 1          | 3          | 3       |
+------------+------------+---------+
| 2          | 1          | 1       |
+------------+------------+---------+
| 2          | 2          | 1       |
+------------+------------+---------+
| 2          | 3          | 1       |
+------------+------------+---------+
| 2          | 4          | 1       |
+------------+------------+---------+

## Write a solution to calculate the number of unique subjects each teacher teaches in the university.

In [ ]:
select teacher_id, count(distinct subject_id) cnt from teacher group by teacher_id

+------------+-----+
| teacher_id | cnt |
+------------+-----+
| 1          | 2   |
+------------+-----+
| 2          | 4   |
+------------+-----+